RIET/src/Catalogs/PSAContracts/PSAContracts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>PSAContracts</name>
  <predefined>
    <items>
      <name>NonPSAAZ</name>
    </items>
    <items>
      <name>NonPSATM</name>
    </items>
  </predefined>
  <attributes>
    <name>Country</name>
    <type>
      <types>CatalogRef.CountriesOfProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>Client</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Segment</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
  <attributes>
    <name>ExpiryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ZeroCustomsCharges</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Closed</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/Catalogs/PSAContracts/ObjectModule.bsl
//////////////////////////////////////////////////////////////////////
// ПРИ КОПИРОВАНИИ

Процедура ПриКопировании(ОбъектКопирования)
	
	РГСофт.ОчиститьCreationModification(ЭтотОбъект);
	
КонецПроцедуры


//////////////////////////////////////////////////////////////////////
// ПЕРЕД ЗАПИСЬЮ

Процедура ПередЗаписью(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДозаполнитьРеквизитыБезДополнительныхДанных();
		
	ПроверитьЗаполнениеРеквизитов(Отказ);
		
КонецПроцедуры

Процедура ДозаполнитьРеквизитыБезДополнительныхДанных()
	
	Код = СокрЛП(Код);
	Client = СокрЛП(Client);
	
	Если ЭтоНовый() Тогда
		РГСофт.ЗаполнитьCreation(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеРеквизитов(Отказ)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(Код)) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Code' is empty!",
			ЭтотОбъект, "Код", , Отказ);
	КонецЕсли;
	
	Если Ссылка <> Справочники.PSAContracts.NonPSAAZ
		И Ссылка <> Справочники.PSAContracts.NonPSATM Тогда
	
		Если НЕ ЗначениеЗаполнено(Country) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"'Country' is empty!",
				ЭтотОбъект, "Country", , Отказ);
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(Client) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"'Client' is empty!",
				ЭтотОбъект, "Client", , Отказ);
		КонецЕсли;
			
		Если НЕ ЗначениеЗаполнено(ExpiryDate) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"'Expiry date' is empty!",
				ЭтотОбъект, "ExpiryDate", , Отказ);
		КонецЕсли;
			
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Segment) Тогда
		
		SegmentParent = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Segment, "Родитель");
		Если ЗначениеЗаполнено(SegmentParent) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Choose Segment, not Sub Segment!",
				ЭтотОбъект, "Segment", , Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
